# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа:
# n — кол-во элементов первого множества.
# m — кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

n = int(input("Введите будущее кол-во чисел в множесте N: "))
m = int(input("Введите будущее кол-во чисел в множесте M: "))

print("Теперь вводите числа в множество N каждое число с новой строки:")
N = set()
for i in range(n):
    N.add(int(input()))
print("Ввод чисел в множество N закончился.")
# print(N)
# print(type(N))

print("Теперь вводите числа в множество M каждое число с новой строки:")
M = set()
for i in range(n):
    M.add(int(input()))
print("Ввод чисел в множество N закончился.")
# print(M)
# print(type(M))
print("В обоих множествах встречаются: ")
print(*set(N.intersection(M)))