# Красивые: Илья Федор Семен Олег Лев Антон Артем Боря Стас Марк Ян
# Умные: Илья Георгий Лев Демьян Антон Владислав Боря Стас Марк Влад
# Сильные: Федор Георгий Олег Демьян Артем Елисей Боря Стас Влад

buty = ["Илья", "Федор", "Семен", "Олег", "Антон", "Артем", "Борис", "Стас", "Марк", "Ян"]
smart = ["Илья", "Георгий", "Лев", "Демьян", "Антон", "Владислав", "Борис", "Стас", "Марк", "Влад"]
strong = ["Федор", "Георгий", "Олег", "Демьян", "Артем", "Елисей", "Борис", "Стас", "Влад"]

beauty = set("Илья Федор Семен Олег Лев Антон Артем Борис Стас Марк Ян".split())
smart = set("Илья Георгий Лев Демьян Антон Владислав Борис Стас Марк Влад".split())
strong = set("Федор Георгий Олег Демьян Артем Елисей Борис Стас Влад".split())

topface = beauty.intersection(smart).intersection(strong)
print(topface)
print(beauty & smart & strong) # полный эквивалент topface = beauty.intersection(smart).intersection(strong) , это пересечния кругов Эйлера
