# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
#
#     5
#     1 2 3 4 5
#     3
#     -> 1

N: int = int(input("Задайте, сколько нужно чисел в массиве?: "))
list_of_int = list()
X: int = 0

for i in range(N+1):
    print(f"i={i}")
    list_of_int.append(int(input()))
    if i == N:
        print("Теперь введите число, которое нужно подсчитать: ")
        X = int(input())
count: int = 0
for i in list_of_int:
    if i == X:
        count += 1

print(list_of_int)
print(f"count = {count}")

