#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки
# были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

N: int = 5
count_of_zero_coin = 3
count_of_ones_coin = 2


x = 1, 2, 3
y = 4,
print(y)
y = 4, 8
print(y)
y = 4,
print(y)
print(type(y))


