/*
    https://gb.ru/lessons/309941/homework
    Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
        Например, даны 2 матрицы:
            2 4 | 3 4
            3 2 | 3 3
        Результирующая матрица будет:
            18 20
            15 18
 */




using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Mission58 // задача 58 решена в целом за 5 минут с помощью IDE "AI CHAT GPT"
{
    internal class Program
    {
        static void Main() // все что находится внутри Main написано самой IDE "AI CHAT GPT" , мной не добавлено ни одного символа ни русского ни английского 
        {
            // Создаем две матрицы размерности 2x2 и инициализируем их значениями
            int[,] matrix1 = new int[2, 2] { { 2, 4 }, { 3, 2 } };
            int[,] matrix2 = new int[2, 2] { { 3, 4 }, { 3, 3 } };

            // Создаем новую матрицу размерности 2x2 для результата перемножения двух исходных матриц
            int[,] result = new int[2, 2];

            // Выполняем перемножение матриц по математическому правилу матричного умножения
            for (int i = 0; i < 2; i++) // для каждой строки первой матрицы
            {
                for (int j = 0; j < 2; j++) // для каждого столбца второй матрицы
                {
                    result[i, j] = 0; // начальное значение элемента результирующей матрицы
                    for (int k = 0; k < 2; k++) // для каждого элемента в строке первой матрицы или столбце второй матрицы
                    {
                        result[i, j] += matrix1[i, k] * matrix2[k, j]; // вычисляем произведение и добавляем в текущий элемент результирующей матрицы
                    }
                }
            }

            // Выводим результат перемножения матриц в консоль
            for (int i = 0; i < 2; i++) // для каждой строки результирующей матрицы
            {
                for (int j = 0; j < 2; j++) // для каждого столбца результирующей матрицы
                {
                    Console.Write(result[i, j] + " "); // выводим элемент результирующей матрицы, добавляем пробел
                }
                Console.WriteLine(); // переходим на следующую строку консоли
            }
        }

    }
}
