/*  https://gb.ru/lessons/309935/homework
 *  Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
 *  645-> 5
 *  78-> третьей цифры нет
 *  32679-> 6
 *  *Сделать вариант для числа длиной до 10 цифр не используя char или string
 */



using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TheTask_13
{
    internal class Program
    {
        static void Main(string[] args)
        {
            while (true) // запускаю бесконечный цикл выполнения приложения 
            { 
                Console.Write("Введите число от 100 и выше: "); // предлагаю поьзователю ввести число в консоли 
                int NNN = Convert.ToInt32(Console.ReadLine()); // конвертирую введенный текст в число 

                if (NNN < 100) // сравниваю переменную с магическим числом для обработки чисел до 100 
                {
                    Console.WriteLine("Вы ввели число меньше 100, третьей цифры тут нет. Попробуем заново."); // уведомляю что с числами меньше 100 приложение неработает 
                    Console.WriteLine(); // вывожу пустую строку для удобства чтения вывода
                    continue; // команад начать цикл заново, тк работу нужно начать сначала 
                }
                
                if (NNN >= 100 && NNN <= 999) // проверяю что введенное число находится в диапазоне от 100 по 999
                {
                    int N3 = NNN % 10; // тут я взял 3ю цифру трехзначного цисла (3ю при счете слева направо), было напрример 123, а осталось 3;
                    Console.WriteLine($"3я цифра введенного числа, это: {N3}"); // вывел сообщение пользователю 
                    Console.WriteLine(); // вывел пустую строку для красоты 
                }

                if (NNN > 999) // проверяю что число больше 999
                {
                    Console.WriteLine("Вы ввели число больше 999, эта версия ПО не обрабатывает такие числа. Попробуем заново."); // если больше 999 то вывожу сообщение 
                    Console.WriteLine(); // вывод пустой строки для красоты 
                    continue; // команда начать работу приложения заново 
                }





            }
        }
    }
}
