/*
    Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
    6 -> да
    7 -> да
    1 -> нет
    * Сделать вариант с использованием конструкции Dictionary
*/




using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace TheTask_15
{
    internal class Program
    {
        static void Main(string[] args)
        {
            while (true) // запускаю бесконечный цикл работы приложения 
            {
                Console.Write("введите номер дня недели от 1 до 7: "); // вывожу приглашение пользователю 
                int n = Convert.ToInt32(Console.ReadLine()); // читаю текстовый ввод пользователя и преобразовываю его в цело число 
                
                if(Equals(n,1)) // сравниваю это число с единицей
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: ПОНЕДЕЛЬНИК"); // если оно равно 1 то вывожу сообщение о дне неделеи 
                }

                if (Equals(n, 2))
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: ВТОРНИК"); // если оно равно 2 то вывожу сообщение о дне неделеи 
                }

                if (Equals(n, 3))
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: СРЕДА"); // если оно равно 3 то вывожу сообщение о дне неделеи 
                }

                if (Equals(n, 4))
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: ЧЕТВЕРГ"); // если оно равно 4 то вывожу сообщение о дне неделеи 
                }

                if (Equals(n, 5))
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: ПЯТНИЦА"); // если оно равно 5 то вывожу сообщение о дне неделеи 
                }

                if (Equals(n, 6))
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: СУББОТА"); // если оно равно 6 то вывожу сообщение о дне неделеи 
                }

                if (Equals(n, 7))
                {
                    Console.WriteLine($"Цифра {n} соответствует дню недели: ВОСКРЕСЕНЬЕ"); // если оно равно 7 то вывожу сообщение о дне неделеи 
                }

                if (n<1 || n>7) // если введенное число не вошло в диапазон от 1 по 7 то 
                {
                    Console.WriteLine($"Цифра {n} не соответствует никакому дню недели"); // то вывожу сообщение что это неверное число 
                }

                Console.WriteLine(); // вывожу пустую строку для красоты 

            }
        }
    }
}
