/*

https://gb.ru/lessons/309941/homework 
Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
    Например, на выходе получается вот такой массив:
        01 02 03 04
        12 13 14 05
        11 16 15 06
        10 09 08 07
 
 От ДАНИЛКОНЕВ: Сначала я не понял что такое спиральное заполнение массива, думал спросить у  куратора, но одернул себя на мысли, 
что у меня есть кое-кто чьи способности часто равны способностям куратора и даже часто превосходят их, 
так что я спросил у GPT и этот ИИ успешно мне все и красиво пояснил, посмотреть можно тут Mission62\GPT\01.png
 */


using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Mission62 // код с комментариями написан в IDE AI CHAT GPT за 10 мин примерно итеративными уточнениям того, что я хочу получить. Код получился красивейший, мало кто из людей так напишет.
{
    internal class Program
    {
        static void Main()
        {

            int[,] array2D = new int[4, 4]; // Создаем двумерный массив размерности 4 на 4.
            int number = 1; // Задаем начальное значение для заполнения массива.

            int startX = 0, endX = 3; // Задаем начальное и конечное значение для координаты X.
            int startY = 0, endY = 3; // Задаем начальное и конечное значение для координаты Y.

            while (number <= 16) // Цикл продолжается, пока массив не будет заполнен всеми значениями от 1 до 16.
            {
                for (int i = startX; i <= endX; i++) // Проходим по первой строке вправо.
                {
                    array2D[startY, i] = number; // Записываем значение в текущую ячейку массива.
                    number++; // Увеличиваем значение на 1.
                }

                for (int i = startY + 1; i <= endY; i++) // Проходим по последнему столбцу вниз.
                {
                    array2D[i, endX] = number; // Записываем значение в текущую ячейку массива.
                    number++; // Увеличиваем значение на 1.
                }

                for (int i = endX - 1; i >= startX; i--) // Проходим по последней строке влево.
                {
                    array2D[endY, i] = number; // Записываем значение в текущую ячейку массива.
                    number++; // Увеличиваем значение на 1.
                }

                for (int i = endY - 1; i >= startY + 1; i--) // Проходим по первому столбцу вверх.
                {
                    array2D[i, startX] = number; // Записываем значение в текущую ячейку массива.
                    number++; // Увеличиваем значение на 1.
                }

                startX++; // Увеличиваем начальное значение координаты X.
                endX--; // Уменьшаем конечное значение координаты X.
                startY++; // Увеличиваем начальное значение координаты Y.
                endY--; // Уменьшаем конечное значение координаты Y.
            }

            // Вывод массива в консоль с отступами между значениями
            for (int i = 0; i < 4; i++)
            {
                for (int j = 0; j < 4; j++)
                {
                    Console.Write(array2D[i, j] + "\t");
                }
                Console.WriteLine();
            }


        }
    }
}
