# Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше,
# либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
# При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

array1 = list("либо задать на старте выполнения алгоритма".split())
print(array1)

array2 = list()
for one_string in array1:
    array2.append(one_string[0:3])
print(array2)

