# Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше,
# либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
# При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

array1 = list("либо задать на старте выполнения алгоритма".split())  # задаю массив как вы и сказали на старте
print(array1)   # вывожу массив, чтобы посмотреть на него что там получилось

array2 = list()     # создаю новый массив, в который положу результаты преобразований
for one_string in array1:      # запускаю цикл по каждому слову в массиве
    array2.append(one_string[0:3])      # беру каждое слово из массива и делаю ему срез от нуля до трех символов как сказано непонятном условии задачи и кладу в новый массив
print(array2)       # вывожу новый он же второй массив чтобы посмотреть что получилось

